Catalogs/упСервераСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСервераСбораДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипСервераСбораДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытияМониторинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Comment>AutoGRAPH</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьВQRКодДанныеАутентификацииНаМобильномКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактыСлужбыПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПолученияДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтсрочкиПолученияДанныхПоСобытиям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПолученияТокен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/MobileClient/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПроверитьУстройство(ID, Name, RouteNumber)
	
	Попытка
		Если ПолучитьФункциональнуюОпцию("упРегистрироватьВызовыВебСервиса") Тогда 
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.CheckID." + ID, УровеньЖурналаРегистрации.Информация,,, RouteNumber);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Name) Тогда
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.CheckID." + ID, УровеньЖурналаРегистрации.Ошибка,,, НСтр(СтрШаблон("ru = 'Неизвестное мобильное устройство. Имени устройства автоматически присвоен его IMEI (%1).'", ID)));
			Name = ID;
		КонецЕсли; 
		Логин = упСЛК.СоздатьОбъект().ПроверитьУстройство(ID, Name, RouteNumber);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Веб сервис.Ошибка.CheckID." + ID, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат Логин;
	
КонецФункции

Функция ПроизвестиАутентификациюПользователя(ID, Login, Password, RouteNumber)
	
	ЕстьОшибки = Ложь;
	
	Попытка
		Если ПолучитьФункциональнуюОпцию("упРегистрироватьВызовыВебСервиса") Тогда 
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.Authentification_tms." + ID, УровеньЖурналаРегистрации.Информация,,, Login + " / " + RouteNumber);
		КонецЕсли;
		
		Результат = упСЛК.СоздатьОбъект().ПроизвестиАутентификациюПользователя(ID, Login, Password, RouteNumber);
	Исключение
		ЕстьОшибки = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Веб сервис.Ошибка.Authentification_tms." + ID, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		//ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;

	Если ЕстьОшибки Тогда
		Результат = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.axelot.ru/tms3/MobileClient", "AuthentificationResult"));
		Результат.Result    = Ложь;
		
		Контакты = КонтактыСлужбыПоддержки();
		Если ЗначениеЗаполнено(Контакты) Тогда
			ТекстОшибки = НСтр(СтрШаблон("ru = 'При попытке аутентификации в системе AXELOT: TMS под пользователем ""%1"" и получении данных о рейсе произошла ошибка. Контакты службы поддержки: %2'", Login, Контакты));
		Иначе
			ТекстОшибки = НСтр(СтрШаблон("ru = 'При попытке аутентификации в системе AXELOT: TMS под пользователем ""%1"" и получении данных о рейсе произошла ошибка. Обратитесь к администратору.'", Login));
		КонецЕсли; 
		
		Результат.ErrorText = ТекстОшибки;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьСостояниеПоРейсу(ID, Messages)
	
	// MessageID
	
	//Попытка
	//	Если ПолучитьФункциональнуюОпцию("упРегистрироватьВызовыВебСервиса") Тогда 
	//		ЗаписьЖурналаРегистрации("Веб сервис.Данные.Status_tms." + ID, УровеньЖурналаРегистрации.Информация,,,);
	//	КонецЕсли;
	//	
	//	Ответ = упСЛК.СоздатьОбъект().ОбновитьСостояниеПоРейсу(ID, Messages);
	//	
	//Исключение
	//	ИнформацияОбОшибке = ИнформацияОбОшибке();
	//	ЗаписьЖурналаРегистрации("Веб сервис.Ошибка.Status_tms." + ID, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	//	ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	//КонецПопытки;
	//
	//Возврат Ответ;
	//
	ЕстьОшибки = Ложь;
	
	Попытка
		Если ПолучитьФункциональнуюОпцию("упРегистрироватьВызовыВебСервиса") Тогда 
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.Status_tms." + ID, УровеньЖурналаРегистрации.Информация,,,);
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("упЛогироватьСодержимоеПакетовВебСервиса") Тогда
			Запись = Новый ЗаписьXML;
			Запись.УстановитьСтроку();
			ФабрикаXDTO.ЗаписатьXML(Запись, Messages);
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.Status." + ID, УровеньЖурналаРегистрации.Информация,,,Запись.Закрыть());
		КонецЕсли;
		
		Ответ = упСЛК.СоздатьОбъект().ОбновитьСостояниеПоРейсу(ID, Messages);
		
	Исключение
		ЕстьОшибки = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Веб сервис.Ошибка.Status_tms." + ID, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		//ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Если ЕстьОшибки Тогда		
		Ответ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.axelot.ru/tms3/MobileClient", "Reply"));
		Ответ.ReplyTime = ТекущаяДатаСеанса();
		
		СообщенияВодителю = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.axelot.ru/tms3/MobileClient", "DispatcherTextMessages"));
		ОтмененныеТочки   = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.axelot.ru/tms3/MobileClient", "RejectedRoutePoints"));
		НовыеТочки        = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.axelot.ru/tms3/MobileClient", "RoutePoints"));
		ИзмененныеТочки   = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.axelot.ru/tms3/MobileClient", "ChangedRoutePoints"));
		ДанныеРейса       = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.axelot.ru/tms3/MobileClient", "ChangedRoutes"));
	
		Ответ.DispatcherTextMessages = СообщенияВодителю;
		Ответ.RejectedRoutePoints    = ОтмененныеТочки;
		Ответ.NewRoutePoints         = НовыеТочки;
		Ответ.ChangedRoutePoints     = ИзмененныеТочки;
		Ответ.ChangedRoutes          = ДанныеРейса;
	КонецЕсли; 
	
	Возврат Ответ;
	
КонецФункции

Функция СохранитьФотографииФайлы(ID, Photos)
	
	Попытка
		Если ПолучитьФункциональнуюОпцию("упРегистрироватьВызовыВебСервиса") Тогда 
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.SetPhotos." + ID, УровеньЖурналаРегистрации.Информация,,,);
		КонецЕсли;
		
		Ответ = упСЛК.СоздатьОбъект().СохранитьФотографииФайлы(ID, Photos);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Веб сервис.Ошибка.SetPhotos." + ID, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьСписокПодключенныхКлиентов(ListDate, ActiveUsers)
	
	Попытка
		Если ПолучитьФункциональнуюОпцию("упРегистрироватьВызовыВебСервиса") Тогда 
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.SetActiveUsersList", УровеньЖурналаРегистрации.Информация,,,);
		КонецЕсли;
		
		Ответ = упСЛК.СоздатьОбъект().ОбновитьСписокПодключенныхКлиентов(ListDate, ActiveUsers);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Веб сервис.Ошибка.SetActiveUsersList", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат Ответ;	
	
КонецФункции

Функция ОбновитьСписокЛицензий(Lisenses)
	
	Попытка
		Если ПолучитьФункциональнуюОпцию("упРегистрироватьВызовыВебСервиса") Тогда 
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.SetLicenseInfo", УровеньЖурналаРегистрации.Информация,,,);
		КонецЕсли;
		
		Ответ = упСЛК.СоздатьОбъект().ОбновитьСписокЛицензий(Lisenses);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Веб сервис.Ошибка.SetLicenseInfo", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат Ответ;	
КонецФункции

Функция ЗарегистрироватьОтсутствиеЛицензии(User)
	
	Попытка
		Если ПолучитьФункциональнуюОпцию("упРегистрироватьВызовыВебСервиса") Тогда 
			ЗаписьЖурналаРегистрации("Веб сервис.Данные.FreeLicenseProblem", УровеньЖурналаРегистрации.Информация,,,);
		КонецЕсли;
		
		Ответ = упСЛК.СоздатьОбъект().ЗарегистрироватьОтсутствиеЛицензии(User);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Веб сервис.Ошибка.FreeLicenseProblem", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат Ответ;	
	
КонецФункции

Функция КонтактыСлужбыПоддержки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Контакты = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упСервераСбораДанных.КонтактыСлужбыПоддержки КАК КонтактыСлужбыПоддержки
	|ИЗ
	|	Справочник.упСервераСбораДанных КАК упСервераСбораДанных
	|ГДЕ
	|	упСервераСбораДанных.Ссылка = ЗНАЧЕНИЕ(Справочник.упСервераСбораДанных.СерверМобильныхПриложений)";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Контакты = Выборка.КонтактыСлужбыПоддержки;
	КонецЕсли; 
	
	Возврат Контакты;

КонецФункции 

#КонецОбласти
